src/Enums/ВидыПериодовМонитораРуководителя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыПериодовМонитораРуководителя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоследниеПолгода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоследнийГод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоследнийДень</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоследнийКвартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоследнийМесяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоследняяНеделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйГод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйДень</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйМесяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекущийМесяц</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыПериодовМонитораРуководителя/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Функция получает начало периода относительно окончания периода.
//
// Параметры:
//  Дата		 - Дата	 - дата окончания
//  ВидПериода	 - ПеречислениеСсылка.ВидыПериодовМонитораРуководителя	 - вид периода.
// 
// Возвращаемое значение:
//  Дата - дата начала.
//
Функция ПолучитьНачалоПериода(Дата, НастройкаВиджета) Экспорт
	
	Результат = Дата;
	
	ВидПериода = НастройкаВиджета.Период; 
	Если ВидПериода = ПоследняяНеделя Тогда
		Результат = НачалоДня(Дата - (7 * 24 * 3600));
	ИначеЕсли ВидПериода = ПоследнийМесяц Тогда
		Результат = НачалоДня(ДобавитьМесяц(Дата, -1));
	ИначеЕсли ВидПериода = ПоследнийКвартал Тогда
		Результат = НачалоДня(ДобавитьМесяц(Дата, -3));
	ИначеЕсли ВидПериода = ПоследниеПолгода Тогда
		Результат = НачалоДня(ДобавитьМесяц(Дата, -6));
	ИначеЕсли ВидПериода = ПоследнийГод Тогда
		Результат = НачалоДня(ДобавитьМесяц(Дата, -12));
	ИначеЕсли ВидПериода = ПоследнийДень Тогда
		Результат = НачалоДня(Дата);
	ИначеЕсли ВидПериода = ПроизвольныйДень Тогда
		Результат = НачалоДня(Дата);
	ИначеЕсли ВидПериода = ПроизвольныйМесяц Тогда
		Результат = Началомесяца(Дата);
	ИначеЕсли ВидПериода = ПроизвольныйГод Тогда
		Результат = НачалоГода(Дата);
	ИначеЕсли ВидПериода = ТекущийМесяц Тогда
		Результат = НачалоМесяца(Дата);
	ИначеЕсли ВидПериода = ПроизвольныйПериод 
		И НастройкаВиджета.Свойство("ПроизвольныйПериод") Тогда
		Результат = НастройкаВиджета.ПроизвольныйПериод.ДатаНачала;
	Иначе 
		Результат = НачалоДня(Дата);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция получает конец периода относительно окончания периода.
//
// Параметры:
//  Дата		 - Дата	 - дата окончания
//  ВидПериода	 - ПеречислениеСсылка.ВидыПериодовМонитораРуководителя	 - вид периода.
// 
// Возвращаемое значение:
//  Дата - дата начала.
//
Функция ПолучитьКонецПериода(Дата, НастройкаВиджета) Экспорт
	
	Результат = Дата;
	
	ВидПериода = НастройкаВиджета.Период;
	Если ВидПериода = ПроизвольныйМесяц Тогда
		Результат = КонецМесяца(Дата); 
	ИначеЕсли ВидПериода = ПроизвольныйГод Тогда
		Результат = КонецГода(Дата);
	ИначеЕсли ВидПериода = ТекущийМесяц Тогда
		Результат = КонецМесяца(Дата);
	ИначеЕсли ВидПериода = ПроизвольныйПериод 
		И НастройкаВиджета.Свойство("ПроизвольныйПериод") Тогда
		Результат = НастройкаВиджета.ПроизвольныйПериод.ДатаОкончания;
	Иначе 
		Результат = КонецДня(Дата);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
